app/controllers/groups_controller.rb

  def createGroup
    @content = JSON.parse(params[:info])
    @group_info = ActiveSupport::JSON.decode(params[:info])

    group = Groups.new
    group.save

    @group_info["emails"].each do |email|
        user = User.where(:email => email).first
        group.users << user
        user.save
    end

    user = User.where(:email => @group_info["leader"]).first
    group.users << user
    user.save
---
INSERT INTO `groups` (`created_at`, `leader_id`, `name`, `updated_at`, `user_id`) VALUES ('2012-09-22 07:48:19', NULL, NULL, '2012-09-22 07:48:19', NULL)
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@test.com' LIMIT 1
UPDATE `users` SET `groups_id` = 3, `updated_at` = '2012-09-22 06:05:45' WHERE `users`.`id` = 1
UPDATE `groups` SET `leader_id` = 3, `name` = 'leader@lead.com', `updated_at` = '2012-09-22 08:49:18' WHERE `groups`.`id` = 16

  def getGroup
    @my_email = ActiveSupport::JSON.decode(params[:info])
    user = User.where(:email => @my_email["my_email"]).first
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@test.com' LIMIT 1