app/controllers/orders_controller.rb

  def submitOrder
   @group_id = params[:group_id]
   @email = params[:email]
   @orders = ActiveSupport::JSON.decode(params[:order])

    #@orders = ActiveSupport::JSON.decode(params[:info])
    #@email = @orders["email"]
    #@group_id = @orders["group_id"]

    user = User.where(:email => @email).first

    @orders.each do |order|
      o = Orders.new
      o.users_id = user.id
      o.groups_id = @group_id
      o.item_name = order["name"]
      o.price = order["price"]
      o.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@test.com' LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`groups_id` = 1
INSERT INTO `orders` (`completed`, `created_at`, `groups_id`, `item_name`, `price`, `updated_at`, `users_id`) VALUES (0, '2012-09-22 08:22:42', 1, 'Salmon', 500, '2012-09-22 08:22:42', 2)

  def getAllOrders
    @group_id = params[:group_id]
    email = params[:email]
    leader = User.where(:email => email).first
    users = User.where(:groups_id => @group_id)
    response = {};

=begin
    users.each do |u|
      orders = Orders.where(:groups_id => @group_id, :users_id => u.id)
      next if (orders.nil? || orders.empty?);
      response[u.email] = orders;
    end
=end

    total_price = 0
    others_price = 0
    leaders_price = 0
    unless leader.nil? || leader.groups_id.to_s != @group_id.to_s
      users.each do |u|
        orders = Orders.where(:groups_id => @group_id, :users_id => u.id)
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = '\"test@test.com\"' LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`groups_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`groups_id` = 1 AND `orders`.`users_id` = 1
SELECT COUNT(*) FROM `orders` WHERE `orders`.`groups_id` = 1 AND `orders`.`users_id` = 1
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 16 LIMIT 1

  def successfulPayments
    @group = ActiveSupport::JSON.decode(params[:info])
    @group_id = @group["group_id"]
    @email = @group["email"]
    leader = User.where(:email => @email).first
    orders = Orders.where(:groups_id => @group_id)
    orders.each do |o|
      user = User.where(:id => o.users_id).first
      order = Orders.where(:id => o.id).first
      order.completed = true
      order.save
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test@test.com' LIMIT 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`groups_id` = 1
SELECT `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `orders` SET `completed` = 1, `updated_at` = '2012-09-22 10:27:37' WHERE `orders`.`id` = 1